{
    "en": {
        "empathy": {
            "name": "Empathy",
            "descriptionSpanish": "La empatía es la capacidad de comprender la vida emocional de otra persona, casi en toda su complejidad. Esto no significa necesariamente compartir las mismas opiniones y argumentos que justifiquen el estado o reacción que expresa la otra persona, sino más bien tratar de experimentar objetiva y racionalmente lo que siente el otro individuo.",
            "descriptionEnglish": "Empathy is the ability to understand the emotional life of another person, almost in all its complexity. This does not necessarily mean sharing the same opinions and arguments that justify the state or reaction expressed by the other person, but rather trying to objectively and rationally experience what the other individual feels."
        },
        "tolerance": {
            "name": "Tolerance",
            "descriptionSpanish": "La tolerancia es la actitud de respetar y aceptar las diferencias que existen entre las personas, ya sean de opinión, creencia, cultura, raza, género u orientación sexual. La tolerancia implica reconocer la dignidad y los derechos de los demás, así como evitar la discriminación y la violencia por razón de la diversidad.",
            "descriptionEnglish": "Tolerance is the attitude of respecting and accepting the differences that exist between people, whether they be of opinion, belief, culture, race, gender or sexual orientation. Tolerance implies recognizing the dignity and rights of others, as well as avoiding discrimination and violence based on diversity."
        },
        "resolutionCapacity": {
            "name": "Resolution Capacity",
            "descriptionSpanish": "La capacidad resolutiva es la capacidad de analizar los problemasque se presentan en una situación dada y encontrar soluciones efectivas y creativas. La capacidad de resolución implica identificar las causas y consecuencias del problema, generar alternativas de acción, evaluar los pros y los contras de cada una y escoger la más adecuada.",
            "descriptionEnglish": "Solving capacity is the ability to analyze the problems that arise in a given situation and find effective and creative solutions. The resolution capacity implies identifying the causes and consequences of the problem, generating action alternatives, evaluating the pros and cons of each one and choosing the most appropriate one."
        },
        "activeListening": {
            "name": "Active Listening",
            "descriptionSpanish": "La escucha activa es la práctica de prestar total atención a lo que dice otra persona, sin interrumpir ni juzgar, y mostrando interés y comprensión en lo que dice. La escucha activa implica el uso de lenguaje verbal y no verbal para mostrar que se está siguiendo el mensaje y dar retroalimentación al remitente.",
            "descriptionEnglish": "Active listening is the practice of paying full attention to what another person is saying, without interrupting or judging, and showing interest and understanding in what they are saying. Active listening involves the use of verbal and non-verbal language to show that the message is being followed through and to give feedback to the sender."
        },
        "assertiveCommunication": {
            "name": "Assertive Communication",
            "descriptionSpanish": "La comunicación asertiva es la forma de expresar pensamientos, sentimientos y opiniones de forma clara, directa y respetuosa, sin agredir ni someter a los demás. La comunicación asertiva implica defender los propios derechos e intereses, pero también reconocer y valorar los de los demás.",
            "descriptionEnglish": "Assertive communication is the way to express thoughts, feelings and opinions in a clear, direct and respectful way, without attacking or subjugating others. Assertive communication implies defending ones own rights and interests, but also recognizing and valuing those of others."
        },
        "conflictManagement": {
            "name": "Conflict Management",
            "descriptionSpanish": "La gestión de conflictos es el conjunto de estrategias y técnicas que se utilizan para prevenir, afrontar y resolver situaciones de desacuerdo o enfrentamiento que se presentan entre personas o colectivos. La gestión de conflictos implica buscar soluciones pacíficas y constructivas que satisfagan las necesidades e intereses de las partes.",
            "descriptionEnglish": "Conflict management is the set of strategies and techniques that are used to prevent, deal with, and resolve situations of disagreement or confrontation that arise between people or groups. Conflict management involves seeking peaceful and constructive solutions that meet the needs and interests of the parties."
        },
        "metacognition": {
            "name": "Metacognition",
            "descriptionSpanish": "La metacognición es el conocimiento y la regulación que uno tiene sobre los propios procesos cognitivos, es decir, sobre cómo aprende, piensa, recuerda o resuelve problemas. La metacognición implica planificar, monitorear y evaluar las estrategias utilizadas para lograr una meta o mejorar el desempeño.",
            "descriptionEnglish": "Metacognition is the knowledge and regulation that one has about ones own cognitive processes, that is, about how one learns, thinks, remembers or solves problems. Metacognition involves planning, monitoring, and evaluating the strategies used to achieve a goal or improve performance."
        },
        "adaptability": {
            "name": "Adaptability",
            "descriptionSpanish": "La adaptabilidad es la capacidad de adaptarse a los cambios que se producen en el entorno o en las circunstancias, manteniendo una actitud positiva y flexible. La adaptabilidad implica ser capaz de modificar comportamientos, actitudes o metas de acuerdo a las demandas u oportunidades que se presenten.",
            "descriptionEnglish": "Adaptability is the ability to adapt to changes that occur in the environment or circumstances, while maintaining a positive and flexible attitude. Adaptability implies being able to modify behaviors, attitudes or goals according to the demands or opportunities that arise."
        },
        "willingnessToLearn": {
            "name": "Willingness To Learn",
            "descriptionSpanish": "La voluntad de aprender es la actitud de buscar activamente nuevas experiencias, conocimientos o habilidades que enriquezcan el desarrollo personal o profesional. La voluntad de aprender implica ser curioso, motivado e interesado en aprender cosas nuevas, así como estar abierto a recibir comentarios o consejos.",
            "descriptionEnglish": "The will to learn is the attitude of actively seeking new experiences, knowledge or skills that enrich personal or professional development. The willingness to learn implies being curious, motivated and interested in learning new things, as well as being open to receiving feedback or advice."
        },
        "collaboration": {
            "name": "Collaboration",
            "descriptionSpanish": "La colaboración se enfoca en el intercambio de habilidades aprendidas que pueden mejorar la productividad, resolver problemas, fomentar relaciones saludables y crear trabajo en equipo. La colaboración implica tener una actitud cooperativa, solidaria y respetuosa con los demás, así como saber comunicarse, coordinarse y negociar para conseguir un resultado común.",
            "descriptionEnglish": "Collaboration focuses on sharing learned skills that can improve productivity, solve problems, foster healthy relationships, and build teamwork. Collaboration implies having a cooperative, supportive and respectful attitude towards others, as well as knowing how to communicate, coordinate and negotiate to achieve a common result."
        },
        "awareness": {
            "name": "Awareness",
            "descriptionSpanish": "La conciencia es la capacidad de reconocer y comprender las propias emociones, pensamientos, motivaciones y valores, así como sus efectos en el comportamiento y las relaciones con los demás. La conciencia implica tener un autoconocimiento profundo y honesto, así como una autoestima equilibrada y una autoaceptación positiva.",
            "descriptionEnglish": "Consciousness is the ability to recognize and understand ones own emotions, thoughts, motivations, and values, as well as their effects on behavior and relationships with others. Consciousness involves having deep and honest self-knowledge, as well as balanced self-esteem and positive self-acceptance."
        },
        "riskTaking": {
            "name": "Risk Taking",
            "descriptionSpanish": "La toma de riesgos es una característica natural del comportamiento humano que ocurre en condiciones inciertas, lo que implica una ecuación entre beneficios y resultados adversos.",
            "descriptionEnglish": "Risk taking is a natural feature of human behavior that occurs under uncertain conditions, implying an equation between benefits and adverse outcomes."
        },
        "criticalThinking": {
            "name": "Critical Thinking",
            "descriptionSpanish": "El pensamiento crítico es la capacidad para analizar y evaluar la información existente respecto a un tema, intentando esclarecer la veracidad de dicha información y alcanzar una idea justificada al respecto ignorando posibles sesgos externos. Su principal función no es tanto generar ideas como revisarlas, analizarlas y evaluarlas desde una perspectiva crítica y objetiva generando respuestas contrastadas y certeras.",
            "descriptionEnglish": "Critical thinking is the ability to analyze and evaluate existing information on a subject, trying to clarify the veracity of said information and reach a justified idea about it, ignoring possible external biases. Its main function is not so much to generate ideas as to review, analyze and evaluate them from a critical and objective perspective, showing contrasting andaccurate answers."
        },
        "creativity": {
            "name": "Creative Thinking",
            "descriptionSpanish": "La creatividad proviene de los conocimientos que la persona ha adquirido e internalizado, es de ellos que nacen luego las ideas originales enfocadas a las necesidades del momento.",
            "descriptionEnglish": "Creativity comes from the knowledge that the person has acquired and internalized, it is from them that original ideas are born focused on the needs of the moment."
        },
        "teamWork": {
            "name": "Teamwork",
            "descriptionSpanish": "El trabajo en equipo se enfoca en la ejecución de un proyecto y cada miembro tiene un rol específico que debe cumplir para que el equipo funcione de manera eficiente",
            "descriptionEnglish": "Teamwork focuses on the execution of a project and each member has a specific role that must be fulfilled for the team to function efficiently."
        },
        "analyticalCapacity": {
            "name": "Analytical Capacity",
            "descriptionSpanish": "La capacidad analítica es la capacidad de una persona para dividir problemas complejos en partes más pequeñas y manejables, identificar patrones y relaciones entre ellos y aplicar el pensamiento lógico para resolverlos.",
            "descriptionEnglish": "Analytical ability is a persons ability to break complex problems into smaller, more manageable parts, identify patterns and relationships between them, and apply logical thinking to solve them."
        },
        "Proactivity": {
            "name": "Proactivity",
            "descriptionSpanish": "La proactividad es la capacidad de anticiparse a los acontecimientos y tomar la iniciativa para que las cosas sucedan. La iniciativa es la capacidad de tomar decisiones y actuar sin que se lo pidan o inciten.",
            "descriptionEnglish": "Proactivity is the ability to anticipate events and take the initiative to make things happen. Initiative is the ability to make decisions and act without being asked or prompted."
        },
        "problemSolving": {
            "name": "Problem Solving",
            "descriptionSpanish": "La resolución de problemas es la habilidad de identificar, analizar y encontrar soluciones efectivas a los desafíos. Implica un enfoque lógico y estructurado para abordar obstáculos y mejorar procesos.",
            "descriptionEnglish": "Problem solving is the ability to identify, analyze, and find effective solutions to challenges. It involves a logical and structured approach to overcoming obstacles and improving processes."
        },
        "initiative": {
            "name": "Initiative",
            "descriptionSpanish": "La iniciativa es la habilidad para tomar acción por cuenta propia, sin necesidad de una dirección constante, identificando oportunidades o problemas y actuando proactivamente para abordarlos.",
            "descriptionEnglish": "Initiative is the ability to take action on one's own, without the need for constant direction, identifying opportunities or problems, and proactively taking steps to address them."
        },
        "strategicThinking": {
            "name": "Strategic Thinking",
            "descriptionSpanish": "El pensamiento estratégico es la capacidad de analizar, planificar y tomar decisiones con un enfoque a largo plazo, considerando el panorama completo y anticipando posibles desafíos y oportunidades.",
            "descriptionEnglish": "Strategic thinking is the ability to analyze, plan, and make decisions with a long-term focus, considering the bigger picture and anticipating potential challenges and opportunities."
        },
        "communication": {
            "name": "Communication",
            "descriptionSpanish": "La comunicación es la habilidad de expresar ideas, información y sentimientos de manera clara y efectiva, tanto de forma verbal como no verbal, y adaptarse a las diferentes audiencias y contextos.",
            "descriptionEnglish": "Communication is the ability to express ideas, information, and feelings clearly and effectively, both verbally and non-verbally, and to adapt to different audiences and contexts."
        }
    }
}
